In [1]:
import pandas as pd
import sqlalchemy
#import pymysql

In [2]:
from sqlalchemy import URL
url_object = URL.create(
    "mysql+pymysql",
    username="root",
    password="Data@123",  # plain (unescaped) text
    host="localhost",
    database="sales",
)
engine = sqlalchemy.create_engine(url_object)
#engine = sqlalchemy.create_engine('mysql+pymysql://root:Data@123@localhost:3306/sales')
engine

Engine(mysql+pymysql://root:***@localhost/sales)

In [6]:
from sqlalchemy import text
#df = pd.read_sql_table('customers',engine)
#df
query = 'Select * from sales.customers'
df = pd.DataFrame(engine.connect().execute(text(query)))
df.head()

  customer_code    custmer_name   customer_type
0        Cus001    Surge Stores  Brick & Mortar
1        Cus002    Nomad Stores  Brick & Mortar
2        Cus003    Excel Stores  Brick & Mortar
3        Cus004  Surface Stores  Brick & Mortar
4        Cus005  Premium Stores  Brick & Mortar

In [8]:
#query = '''
# SELECT customers.name, customers.phone_number, orders.name, orders.amount
# FROM customers INNER JOIN orders
# ON customers.id=orders.customer_id
#'''
#df = pd.DataFrame(engine.connect().execute(text(query)))
#df.head()

In [9]:
df = pd.read_csv("customers.csv")
df

     Customer Name  Customer Phone
0     rafael nadal      4567895647
1  maria sharapova       434534545
2   vladimir putin        89345345
3      kim un jong       123434456
4       jeff bezos       934534543
5     rahul gandhi        44324222

In [10]:
df.rename(columns={
    'Customer Name': 'name',
    'Customer Phone': 'phone_number'
}, inplace=True)
df

              name  phone_number
0     rafael nadal    4567895647
1  maria sharapova     434534545
2   vladimir putin      89345345
3      kim un jong     123434456
4       jeff bezos     934534543
5     rahul gandhi      44324222

In [12]:
#df.to_sql(
#    name='customers', # database table name
#    con=engine,
#    if_exists='append',
#    index=False
#)